---
kind: method
id: M:Autodesk.Revit.DB.ForgeTypeId.op_Equality(Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.ForgeTypeId)
source: html/e4a0be4e-69c2-3113-6448-5293ac0580ba.htm
---
# Autodesk.Revit.DB.ForgeTypeId.op_Equality Method

## Syntax (C#)
```csharp
public static bool operator ==(
	ForgeTypeId lhs,
	ForgeTypeId rhs
)
```

## Parameters
- **lhs** (`Autodesk.Revit.DB.ForgeTypeId`)
- **rhs** (`Autodesk.Revit.DB.ForgeTypeId`)